app/Controllers/catalogo_controller.php

            // Por defecto se ordena aleatorio
            $datos['productos'] = $prodModel->orderBy('precio_venta','RANDOM')->findAll(); //filtro
            // titulo
            $data['productos'] = $prodModel->findAll();
---
SELECT *
FROM `productos`

    public function verProducto($id=null){
        $prodModel = new productos_model();
        $datos['productos'] = $prodModel->where('id', $id)->findAll();
        $data['productos'] = $prodModel->findAll();
---
SELECT *
FROM `productos`
WHERE `id` = '20'
SELECT *
FROM `productos`