app/Controllers/consulta_controller.php

SELECT *
FROM `consultas`
SELECT *
FROM `productos`
---
    public function consulta(){
        $prodModel = new productos_model();
        $formModel = new consulta_model();
        $datos['consultas'] = $formModel->findAll();
        // Página de consultas admin, tabla con consultas
        $data['productos'] = $prodModel->findAll();