app/Controllers/Home.php

    public function index()
    {
        //Productos en oferta (aleatorios)
        $prodModel = new productos_model();
        $datosx = $prodModel->orderBy('precio_venta','RANDOM')->findAll();
        for($i = 1; $i <= 4; $i++){
            $datos['productos'] [] = $datosx[$i];
        }
        //Obtener array de todos los productos para el nav (buscador)
        $data['productos'] = $prodModel->findAll();
---
SELECT *
FROM `productos`