app/Controllers/Login_controller.php

SELECT *
FROM `productos`
---
    public function login() {
        $prodModel = new productos_model();
        $data['productos'] = $prodModel->findAll();