app/Controllers/panel_controller.php

    public function cuenta(){
        $prodModel = new productos_model();
        $userModel = new usuarios_model();
        $session = session();
        $datos['usuario'] = $userModel->where('id', $session->get('id'))->first();
        $data['productos'] = $prodModel->findAll();
---
SELECT *
FROM `usuarios`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `productos`